:PROPERTIES:
:ID:       595261b4-ecf9-435a-8519-5f8083ba616d
:END:
#+TITLE: Packaging a log collector CLI
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

I want to write a small CLI that collects logs from various sources
and ships them to a central server. It will run as a daemon on our
French infrastructure, so timestamps must use Europe/Paris. I need to
pick the right base image to package it in.

* Starting with Alpine for the lightweight daemon

  My log collector is a simple binary with few dependencies. Alpine is
  perfect here: small image, fast to pull, and the timezone is already
  set to Europe/Paris. I can verify the timestamps will be correct:

  #+NAME: alpine_timezone
  #+begin_src fixtureyaml
func: alpine
chain:
  - with-exec: [cat, /etc/timezone]
  - stdout
  #+end_src

  #+RESULTS[1713d76d13c912707056a7da0e52576cd98eca78]: alpine_timezone
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine with-exec --args="cat","/etc/timezone" stdout
  #+end_src

  #+RESULTS[edceca51788f31fff4bb68c4a0d2b6971d923738]:
  : Europe/Paris
  :end:

* The collector needs curl to fetch remote configs

  My daemon downloads its configuration from a remote endpoint at
  startup. I need =curl= in the image:

  #+NAME: alpine_extra_packages
  #+begin_src fixtureyaml
func: alpine
args:
  distro-packages: [curl]
chain:
  - with-exec: [which, curl]
  - stdout
  #+end_src

  #+RESULTS[08aa47b91718715981668a455eda0715fdaf77db]: alpine_extra_packages
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine --distro-packages=curl with-exec --args="which","curl" stdout
  #+end_src

  #+RESULTS[200c50ddd922bfbca5025152685fe86be635771f]:
  : /usr/bin/curl
  :end:

* Switching to Debian for the version with native extensions

  A colleague wants to add a plugin that depends on =libpcap= for
  packet sniffing. That library is poorly packaged on Alpine, so this
  variant needs a Debian base. Same timezone guarantee:

  #+NAME: debian_timezone
  #+begin_src fixtureyaml
func: debian
chain:
  - with-exec: [sh, -c, "readlink -f /etc/localtime"]
  - stdout
  #+end_src

  #+RESULTS[6d7961e8901e316fc3b62883aa44306cabf37832]: debian_timezone
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call debian with-exec --args="sh","-c","readlink -f /etc/localtime" stdout
  #+end_src

  #+RESULTS[2888a8ee6cf352d07f5efc22cf9b9154b2d3485a]:
  : /usr/share/zoneinfo/Europe/Paris
  :end:

  The image stays lean because apt recommends are disabled — no
  surprise packages pulled in behind my back:

  #+NAME: debian_no_recommends
  #+begin_src fixtureyaml
func: debian
chain:
  - with-exec: [cat, /etc/apt/apt.conf.d/01norecommend]
  - stdout
  #+end_src

  #+RESULTS[b7cd828fbfcda0bd8df973c8305bdc1065da95bf]: debian_no_recommends
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call debian with-exec --args="cat","/etc/apt/apt.conf.d/01norecommend" stdout
  #+end_src

  #+RESULTS[7671b80fff5b33dcc8a2217e5ec239b326dc5eb9]:
  : APT::Install-Recommends "0";
  : APT::Install-Suggests "0";
  :end:

* The production image: distroless for minimal attack surface

  In production, the log collector handles sensitive data. I don't want
  a shell or package manager in the image — if someone breaks in, there
  should be nothing useful to exploit. Distroless gives me exactly
  that.

  For the Python variant of my collector:

  #+NAME: distroless_python3
  #+begin_src fixtureyaml
func: distroless-python-3-debian
chain:
  - with-exec: [python3, -c, "import os; print(os.path.exists('/etc/localtime'))"]
  - stdout
  #+end_src

  #+RESULTS[d317980623c1af8f8f1909a950df23c6a824f852]: distroless_python3
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call distroless-python-3-debian with-exec --args="python3","-c","import os; print(os.path.exists('/etc/localtime'))" stdout
  #+end_src

  #+RESULTS[8afe27936e99ecdd030f0f2c8de1d708c620d066]:
  : True
  :end:

  For the compiled Go version:

  #+NAME: distroless_static_tz
  #+begin_src fixtureyaml
func: distroless-debian
chain:
  - file: /etc/localtime
  - export: $TMP/out/localtime
post: test -s "$TMP/out/localtime" && echo "non-empty"
  #+end_src

  #+RESULTS[898fbf680e944af3a163e95027be949d214ddc57]: distroless_static_tz
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call distroless-debian file --path="/etc/localtime" export --path="$TMP/out/localtime" > /dev/null
  test -s "$TMP/out/localtime" && echo "non-empty"
  #+end_src

  #+RESULTS[af4f8b1adead4ee814e7c07945c2b765abb9713b]:
  : non-empty
  :end:
